{
  "experiences": [
    {
      "company": "Collaboration Factory AG",
      "location": "Munich, Germany",
      "period": "09/2022 - Present",
      "role": "Frontend Developer",
      "tasks": [
        "Development and maintenance of a library of reusable UI components using Angular and PrimeNg, that result in a 50% reduction in development time and effort.",
        "Build independent UI components in isolation using 'Storybook'.",
        "Implementation of new design specifcations (Figma) with close collaboration with designers and product owners.",
        "Analyse and ensure the accessibility of the UI components.",
        "Conduct peer code reviews.",
        "Participate in Agile software development methodologies, including daily stand-ups, sprint reviews, planning, and retrospective meetings."
      ]
    },
    {
      "company": "Infosys Limited",
      "location": "Trivandrum, Kerala, India",
      "period": "03/2019 - 05/2022",
      "role": "Frontend Developer",
      "tasks": [
        "Rebuilt the user interface using modern, visually appealing design specifcations (Adobe XD) with close collaboration with the designers and product owners.",
        "Developed responsive user interfaces using Angular and Angular-Material with improved usability and enhanced user experience.",
        "Updated old code bases to modern development standards, improving functionality and performance.",
        "Documented technical workfows and knowledge to educate newly hired employees and mentored junior team members.",
        "Worked on Proof of Concepts to determine the feasibility and validate the proposed solution.",
        "Collaborated on the various stages of software development using Agile Methodology, including requirement gathering, coding, testing, and debugging."
      ]
    },
    {
      "company": "Tata Consultancy Service",
      "location": "Kochi, Kerala, India",
      "period": "10/2016 - 03/2019",
      "role": "Developer",
      "tasks": [
        "Developed, implemented, and managed middleware for System Integration for transferring, transforming, and processing data in the system.",
        "Worked on fiancial message communication using SWIFT messages.",
        "Worked on the analysis and development of message format defnition."
      ]
    }
  ]
}
